Autodesk.Revit.DB.IFC.ImporterIFCUtils.CreateEmptyFamily(Autodesk.Revit.DB.IFC.ImporterIFC,Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,System.String)
Creates an empty family of a given category.
importerIFC:
The importer.
aDoc:
The document to create the family.
catId:
The category id.
familyName:
The family name.
Returns:
The created family id.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014